{
    "Africa": {
        "Kenya": {
            "Nairobi National Museum": {
                "description": "The Nairobi National Museum is a captivating hub of cultural heritage in Kenya. Within its walls, you'll find fascinating exhibits: from the Cradle of Human Kind Gallery showcasing early humans and Stone Age tools, to the Bird's Gallery with its diverse avian wonders. Explore the History of Kenya Gallery, learn about mammals in the Story of Mammals Gallery, and immerse yourself in the Cycles of Life Gallery. Don't miss the Numismatic Exhibition, which sheds light on trade, banking, and digital technology. It's a vibrant celebration of Kenya's past and present!",
                "images": [],
                "position": {
                    "lat": -1.273543,
                    "lng": 36.815028
                }
            }
        },
        "Tanzania": {
            "Serengeti": {
                "description": "The Serengeti is a vast ecosystem located in East-Central Africa, spanning approximately 12,000 square miles across northern Tanzania and extending to southwestern Kenya. It's renowned for its large mammal diversity and the Great Migration, where millions of wildebeest, zebras, and other species move in a seasonal pattern for grazing. The name 'Serengeti' comes from the Maasai language, meaning 'endless plains,' aptly describing the area's sprawling landscapes. This region is also crucial for conservation efforts and ecological studies, providing insights into the complex interactions within natural habitats.",
                "images": [
                    {
                        "src": "/assets/serengeti_ai1.jpg",
                        "alt": "Group of elephants taking shade under a tree"
                    }
                ],
                "position": {
                    "lat": -2.279346,
                    "lng": 34.796600
                }
            }
        }
    },
    "Asia": {
        "China": {
            "Great Wall": {
                "description": "The Great Wall of China is an impressive defensive structure that spans thousands of miles across northern China. Built over centuries, it served as a barrier against nomadic invaders and winds through rugged terrain, including mountains and rivers. The most well-preserved sections date back to the Ming dynasty and remain a testament to human engineering and perseverance. Designated a UNESCO World Heritage site, the Great Wall stands as a symbol of China's rich history and resilience.",
                "images": [
                    {
                        "src": "/assets/great_wall_of_china.jpg",
                        "alt": "Great Wall of China"
                    },
                    {
                        "src": "/assets/great_wall_of_china_ai2.jpg",
                        "alt": "Great Wall of China"
                    },
                    {
                        "src": "/assets/great_wall_of_china_ai3.jpg",
                        "alt": "Great Wall of China"
                    }
                ],
                "position": {
                    "lat": 40.431908,
                    "lng": 116.570374
                }
            }
        }
    },
    "Europe": {},
    "North America": {},
    "South America": {},
    "Oceania": {}
}
